#+TITLE: Snippetbox Development

Documented approach taken towards building Snippetbox.

** Project Setup

#+begin_src sh
pwd
#+end_src

#+RESULTS:
: /home/akuma/lab/jessemolina/lab-lets-go

#+begin_src sh
go mod init jessemolina.xyz/lab-lets-go
#+end_src

#+RESULTS:

#+begin_src sh :results pp
go env | grep MODULE
#+end_src

#+RESULTS:
: GO111MODULE="auto"

*** HTTP Status Codes

#+begin_src go :tangle main.go
func createSnippet(w http.RequestWriter, r *http.Request) {
	if r.Method != http.MethodPost {
		w.WriteHeader(405)
		w.Write([]byte("method not allowed"))
		return
	}

	w.Write([]byte("create a new snippet"))
}
#+end_src

#+begin_src sh :results pp
curl -i localhost:4000/snippet/create
#+end_src

#+RESULTS:
: HTTP/1.1 405 Method Not Allowed
: Date: Wed, 16 Feb 2022 22:37:35 GMT
: Content-Length: 18
: Content-Type: text/plain; charset=utf-8
: 
: method not allowed

#+begin_src sh :results pp
curl -i localhost:4000/snippet/create -X POST
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Date: Wed, 16 Feb 2022 22:36:36 GMT
: Content-Length: 20
: Content-Type: text/plain; charset=utf-8
: 
: create a new snippet

*** Customizing Headers

#+begin_src go :tangle main.go
func createSnippet(w http.RequestWriter, r *http.Request) {
	if r.Method != http.MethodPost {
		w.Header().Set("Use This Instead", http.MethodPost)
		w.WriteHeader(405)
		w.Write([]byte("Allowed"))
		return
	}

	w.Write([]byte("create a new snippet"))
}
#+end_src

#+begin_src sh :results pp
curl -i localhost:4000/snippet/create
#+end_src

#+RESULTS:
: HTTP/1.1 405 Method Not Allowed
: use this instead: POST
: Date: Wed, 16 Feb 2022 22:43:03 GMT
: Content-Length: 18
: Content-Type: text/plain; charset=utf-8
: 
: method not allowed
*** The http.Error Shortcut

#+begin_src go
func createSnippet(w http.ResponseWriter, r *http.Request) {
	if r.Method != http.MethodPost {
		w.Header().Set("Allow", http.MethodPost)
		http.Error(w, "method not allowed", 405)
		return
	}

	w.Write([]byte("create a new snippet"))
}
#+end_src

#+begin_src sh :results pp
curl -i localhost:4000/snippet/create
#+end_src

#+RESULTS:
: HTTP/1.1 405 Method Not Allowed
: Allowed: POST
: Content-Type: text/plain; charset=utf-8
: X-Content-Type-Options: nosniff
: Date: Wed, 16 Feb 2022 22:48:15 GMT
: Content-Length: 19
: 
: method not allowed
** Project Structure and Organization

#+begin_src sh :results pp
tree
#+end_src

#+RESULTS:
#+begin_example
.
├── cmd
│   └── web
│       ├── handlers.go
│       └── main.go
├── go.mod
├── pkg
├── README.org
└── ui
    ├── html
    └── static

6 directories, 4 files
#+end_example

#+begin_src sh
go run ./cmd/web
#+end_src

#+begin_src sh
curl localhost:4000/
#+end_src

#+RESULTS:
: system online

** Serving Static Files

#+begin_src sh
curl https://www.alexedwards.net/static/sb.v130.tar.gz | tar -xvz -C ./ui/static
#+end_src

#+begin_src sh :results pp
tree
#+end_src

#+RESULTS:
#+begin_example
.
├── cmd
│   └── web
│       ├── handlers.go
│       └── main.go
├── go.mod
├── makefile
├── pkg
├── README.org
└── ui
    ├── html
    │   ├── base.layout.tmpl
    │   ├── footer.partial.tmpl
    │   └── home.page.tmpl
    └── static
        ├── css
        │   └── main.css
        ├── img
        │   ├── favicon.ico
        │   └── logo.png
        └── js
            └── main.js

9 directories, 12 files
#+end_example
